sample_app_rails_4/app/controllers/users_controller.rb

UPDATE "users" SET "email" = ?, "name" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["email", "new@example.com"], ["name", "New Name"], ["password_digest", "$2a$04$oBaTaVwbPeZnyt7zMuyTP.WJe1yg9jsDcW13o2kWfujnEIFUUS/MK"], ["updated_at", "2014-05-14 00:15:35.575146"]]
---
  def update
    if @user.update_attributes(user_params)